Tópicos2024/app/Models/ClimaModel.php

    public function getUbicaciones()
    {
        $db = db_connect();
        $builder = $db->table('clima')
            ->select('ubicacion')
            ->groupBy('ubicacion');

        $query = $builder->get();
---
SELECT `ubicacion`
FROM `clima`
GROUP BY `ubicacion`

    public function getClimaByCP()
    {
        $request = request();
        $CP = $request->getGet('CP');
        $db = db_connect();
        $builder = $db->table('clima')
            ->select('latitud,longitud,fecha,hora,temperatura,humedad')
            ->where('CP', $CP);
        $query = $builder->get();
---
SELECT `latitud`, `longitud`, `fecha`, `hora`, `temperatura`, `humedad`
FROM `clima`
WHERE `CP` = '5'

    public function getClimaByFechas()
    {
        $request = request();
        $fechaInicial = $request->getGet('fechaInicial');
        $fechaFinal = $request->getGet('fechaInicial');
        $db = db_connect();
        $builder = $db->table('clima')
            ->select('latitud,longitud,fecha,hora,temperatura,humedad')
            ->where('fecha>=', $fechaInicial)->orWhere('fecha<=', $fechaFinal);
        $query = $builder->get();
---
SELECT `latitud`, `longitud`, `fecha`, `hora`, `temperatura`, `humedad`
FROM `clima`
WHERE `fecha` >= '2024-01-01'
OR `fecha` <= '2024-01-01'